---
title: BaseExportOptions
classe: Autodesk.Revit.DB.BaseExportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# BaseExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExportColorMode Colors { get; set; }` | `baseExportOptions.Colors` | ExportColorMode |
| `String HatchPatternsFileName { get; set; }` | `baseExportOptions.HatchPatternsFileName` | String |
| `Boolean HideReferencePlane { get; set; }` | `baseExportOptions.HideReferencePlane` | Boolean |
| `Boolean HideScopeBox { get; set; }` | `baseExportOptions.HideScopeBox` | Boolean |
| `Boolean HideUnreferenceViewTags { get; set; }` | `baseExportOptions.HideUnreferenceViewTags` | Boolean |
| `Boolean IsValidObject { get; }` | `baseExportOptions.IsValidObject` | Boolean |
| `String LayerMapping { get; set; }` | `baseExportOptions.LayerMapping` | String |
| `Boolean PreserveCoincidentLines { get; set; }` | `baseExportOptions.PreserveCoincidentLines` | Boolean |
| `PropOverrideMode PropOverrides { get; set; }` | `baseExportOptions.PropOverrides` | PropOverrideMode |
| `Void Dispose()` | `baseExportOptions.Dispose()` | Void |
| `ExportFontTable GetExportFontTable()` | `baseExportOptions.GetExportFontTable()` | ExportFontTable |
| `ExportLayerTable GetExportLayerTable()` | `baseExportOptions.GetExportLayerTable()` | ExportLayerTable |
| `ExportLinetypeTable GetExportLinetypeTable()` | `baseExportOptions.GetExportLinetypeTable()` | ExportLinetypeTable |
| `ExportPatternTable GetExportPatternTable()` | `baseExportOptions.GetExportPatternTable()` | ExportPatternTable |
| `IList<String> GetPredefinedSetupNames(Document)` | `BaseExportOptions.GetPredefinedSetupNames(document)` | IList<String> |
| `Void SetExportFontTable(ExportFontTable)` | `baseExportOptions.SetExportFontTable(fontTable)` | Void |
| `Void SetExportLayerTable(ExportLayerTable)` | `baseExportOptions.SetExportLayerTable(layerTable)` | Void |
| `Void SetExportLinetypeTable(ExportLinetypeTable)` | `baseExportOptions.SetExportLinetypeTable(linetypeTable)` | Void |
| `Void SetExportPatternTable(ExportPatternTable)` | `baseExportOptions.SetExportPatternTable(patternTable)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```